Tekla Open API Reference for Tekla Structures 2025
UserPropertyOption Properties
The UserPropertyOption type exposes the following members.
Properties
Name | Description
DoubleValue
 The double value.
IntValue
 The integer value.
OptionLabel
 The option name.
OptionLabelTranslated
 The translated option name.
StringValue
 The string value.
Top
See Also
Reference
UserPropertyOption Class
Tekla.Structures.Catalogs Namespace